// 1 - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
//
// 2 - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//
// 3 - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
//
// 4 - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//
// 5 - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//
// 6 - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//
// 7 - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!


// 1 - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let x = +prompt('введіть число');
//
// if (x >= 0 && x <= 14) {
//     document.write('перша чверть')
// } else if (x >= 15 && x <= 29) {
//     document.write('друга чверть')
// } else if (x >= 30 && x <= 44) {
//     document.write('третя чверть')
// } else if (x >= 45 && x <= 59) {
//     document.write('четверта чверть')
// } else {
//     document.write('спробуй ще')
// }

// 2 - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//

// let y = +prompt('введіть число');
//
// if ( y >= 1 && y <= 10) {
//     document.write('1')
// }
//
// else if ( y >= 11 && y <= 20) {
//     document.write('2')
// }
//
// else if ( y >= 21 && y <= 31) {
//     document.write('3')
// }
//
// else {
//     document.write('спробуй ще')
// }

// 3 - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = 1<2
//
// if (test === true) {
//     console.log('Вірно');
// }
// else {
//     console.log('не Вірно');
// }

// let test = 1===1;
// test === true ? console.log('Вірно') : console.log('не Вірно');


// 4 - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = -3
//
// if (a !== 0) {
//     console.log('Вірно');
// }
// else {
//     console.log('не Вірно');
// }

// 5 - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let day = +prompt('Введіть день число від 1 до 7 ')
//
// if ( day >= 1 && day <= 7) {
//
//     switch (day) {
//         case 1:
//             console.log('ПН - робота')
//             break;
//         case 2:
//             console.log('ВТ - робота')
//             break;
//         case 3:
//             console.log('СР - робота')
//             break;
//         case 4:
//             console.log('ЧТ - робота')
//             break;
//         case 5:
//             console.log('ПТ - робота')
//             break;
//         case 6:
//             console.log('СБ - робота')
//             break;
//         case 7:
//             console.log('НД - робота')
//             break;
//     }
// }
//
// else {
//     console.log('НІТ!')
// }

// 6 - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let y = +prompt('введіть рік');
//
// if (y % 4 === 0)  {
//     if (y % 100 === 0) {
//         if (y % 400 === 0) {
//             alert(y + " is a leap year");
//         } else {
//             alert(y + " is not a leap year");
//         }
//     } else {
//         //if year is divisible by 4 but not 100, it is a leap year
//         alert(y + " is a leap year");
//     }
// } else {
//     alert(y + " is not a leap year");
// }

// 7 - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let q = prompt('Яка «офіційна» назва JavaScript?');
//
// if ( q === 'ECMAScript') {
//     document.write('Правильно!');
// }
//
// else {
//     document.write('Не знаєте? ECMAScript!!');
// }